Python 3.5.2 (v3.5.2:4def2a2901a5, Jun 25 2016, 22:01:18) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> 
============ RESTART: E:\1. 과제\전국과제\2023\[B] 경남\2 과제\idle\main.py ============

┌─────────────────────┐
│2023-08-29 [18:34:44]│
└─────────────────────┘

006041302500 0 4
[10, 0, 3] 0
>>> 
============ RESTART: E:\1. 과제\전국과제\2023\[B] 경남\2 과제\idle\main.py ============

┌─────────────────────┐
│2023-08-29 [18:36:28]│
└─────────────────────┘

006041302500 0 4
0 4
>>> 
============ RESTART: E:\1. 과제\전국과제\2023\[B] 경남\2 과제\idle\main.py ============

┌─────────────────────┐
│2023-08-29 [18:36:31]│
└─────────────────────┘

006041302500 0 4
>>> 
============ RESTART: E:\1. 과제\전국과제\2023\[B] 경남\2 과제\idle\main.py ============

┌─────────────────────┐
│2023-08-29 [18:36:43]│
└─────────────────────┘

406001302500 0 4
>>> 
============ RESTART: E:\1. 과제\전국과제\2023\[B] 경남\2 과제\idle\main.py ============

┌─────────────────────┐
│2023-08-29 [18:36:48]│
└─────────────────────┘

[[[4, 0], 4], [[8, 4], 2], [[5, 1], 1], [[4, 5], 2], [[2, 3, 7], 6], [[1, 2], 1], [[5, 1], 2], [[6, 5], 3], [[2, 6], 1], [[1, 2], 2], [[2, 3], 2], [[3, 0], 4, 2], [[0, 1], 2], [[3, 2], 4], [[7, 11], 6], [[2, 3, 7], 4], [[1, 2], 2], [[2, 3], 2], [[6, 2], 1], [[7, 6], 4], [[2, 1], 1], [[6, 2], 4], [[1, 0, 4], 1], [[2, 1], 4], [[1, 0], 4], [[0, 3], 2, 4], [[0, 1], 2], [[3, 2], 4], [[5, 6], 3], [[1, 5], 2], [[4, 0, 1], 1], [[5, 4], 2], [[9, 8], 5], [[2, 3, 7], 4], [[6, 2], 3], [[1, 5], 1], [[2, 1], 3], [[11, 10, 9], 6], [[7, 3, 2], 4], [[2, 3, 7], 4], [[9, 10, 6], 6]]
41step, idle 0.015737s(dart 0m 3s) 

>>> 
========== RESTART: E:\1. 과제\전국과제\2023\[B] 경남\2 과제\idle\.factory.py ==========

┌─────────────────────┐
│2023-08-29 [18:36:57]│
└─────────────────────┘

['001000346205', '060005432001', [[4, 10, 3], [5, 1, 2], [2, 1, 5]]]
[1] | 2,'320050461000','504060032010',[[9, 3, 11], [3, 6, 1], [1, 3, 6]]
Average Step : 9
Average Time : 0.0s(dart 0m 0s)
Maximum Time : 0.015655s(dart 0m 3s)
60step, idle 0.015655s(dart 0m 3s)

[2] | 2,'400020501063','460001002350',[[3, 2, 7], [6, 4, 2], [4, 2, 6]]
Average Step : 34
Average Time : 0.007827s(dart 0m 1s)
Maximum Time : 0.015659s(dart 0m 3s)
48step, idle 0.015659s(dart 0m 3s)

[3] | 2,'031240005060','243105006000',[[6, 9, 11], [2, 1, 3], [3, 1, 2]]
Average Step : 39
Average Time : 0.010438s(dart 0m 2s)
Maximum Time : 0.015737s(dart 0m 3s)
41step, idle 0.015737s(dart 0m 3s)

[6] | 2,'602305041000','206040351000',[[9, 10, 11], [6, 3, 5], [5, 6, 3]]
Average Step : 42
Average Time : 0.01046s(dart 0m 2s)
Maximum Time : 0.022241s(dart 0m 5s)
48step, idle 0.022241s(dart 0m 5s)

[9] | 2,'630025001040','053610042000',[[9, 11, 6], [4, 1, 6], [1, 6, 4]]
Average Step : 43
Average Time : 0.011188s(dart 0m 2s)
Maximum Time : 0.031244s(dart 0m 7s)
52step, idle 0.031244s(dart 0m 7s)

[17] | 2,'032040150060','061002450030',[[9, 3, 11], [6, 4, 3], [6, 3, 4]]
Average Step : 42
Average Time : 0.011444s(dart 0m 2s)
Maximum Time : 0.037855s(dart 0m 9s)
60step, idle 0.037855s(dart 0m 9s)

[29] | 2,'206300041050','010032054060',[[6, 11, 9], [1, 5, 4], [4, 5, 1]]
Average Step : 44
Average Time : 0.012558s(dart 0m 3s)
Maximum Time : 0.037865s(dart 0m 9s)
41step, idle 0.037865s(dart 0m 9s)

[75] | 2,'054003006021','034100000625',[[6, 7, 0], [3, 6, 4], [4, 3, 6]]
Average Step : 41
Average Time : 0.01185s(dart 0m 2s)
Maximum Time : 0.046869s(dart 0m 11s)
51step, idle 0.046869s(dart 0m 11s)

[1011] | 2,'001302006504','020003016405',[[10, 6, 0], [3, 5, 2], [2, 3, 5]]
Average Step : 39
Average Time : 0.013214s(dart 0m 3s)
Maximum Time : 0.046987s(dart 0m 11s)
53step, idle 0.046987s(dart 0m 11s)

[1076] | 2,'063021000450','054030001260',[[7, 6, 0], [2, 1, 3], [3, 2, 1]]
Average Step : 39
Average Time : 0.01327s(dart 0m 3s)
Maximum Time : 0.053488s(dart 0m 13s)
50step, idle 0.053488s(dart 0m 13s)

[1846] | 2,'001204036050','065103000420',[[11, 6, 0], [6, 4, 3], [3, 6, 4]]
Average Step : 40
Average Time : 0.013562s(dart 0m 3s)
Maximum Time : 0.053608s(dart 0m 13s)
69step, idle 0.053608s(dart 0m 13s)

[2752] | 2,'060530002410','063040010520',[[6, 0, 5], [2, 4, 5], [2, 5, 4]]
Average Step : 40
Average Time : 0.013588s(dart 0m 3s)
Maximum Time : 0.057056s(dart 0m 14s)
39step, idle 0.057056s(dart 0m 14s)

[15060] | 2,'025000043601','043506001200',[[10, 6, 0], [6, 5, 4], [5, 4, 6]]
Average Step : 40
Average Time : 0.013371s(dart 0m 3s)
Maximum Time : 0.06249s(dart 0m 15s)
50step, idle 0.06249s(dart 0m 15s)

[17457] | 2,'012004005603','000053001426',[[3, 6, 0], [4, 6, 3], [6, 3, 4]]
Average Step : 40
Average Time : 0.013373s(dart 0m 3s)
Maximum Time : 0.062601s(dart 0m 15s)
56step, idle 0.062601s(dart 0m 15s)

[68493] | 2,'026043001500','024060050103',[[10, 0, 3], [5, 2, 1], [1, 5, 2]]
Average Step : 40
Average Time : 0.013404s(dart 0m 3s)
Maximum Time : 0.069015s(dart 0m 17s)
75step, idle 0.069015s(dart 0m 17s)

[75979] | 2,'000005164230','004261300050',[[11, 1, 0], [4, 2, 5], [2, 4, 5]]
Average Step : 40
Average Time : 0.013418s(dart 0m 3s)
Maximum Time : 0.069088s(dart 0m 17s)
51step, idle 0.069088s(dart 0m 17s)

[80892] | 2,'060410053200','001604030250',[[11, 0, 6], [6, 1, 5], [5, 1, 6]]
Average Step : 40
Average Time : 0.013444s(dart 0m 3s)
Maximum Time : 0.108593s(dart 0m 27s)
43step, idle 0.108593s(dart 0m 27s)

Average Step : 40
Average Time : 0.013448s(dart 0m 3s)
Maximum Time : 0.108593s(dart 0m 27s)

☆★☆★☆★☆★☆★☆
★  COMPLETED !!! ★
☆★☆★☆★☆★☆★☆
>>> 
